if __name__ == "__main__":
    """
    _この課題はDailyよりも比較的難易度の高い課題である。_
    https://fate.5ch.net/test/read.cgi/lovelive/1514766180/-1000
    はとある掲示板のスレッドのURLである。
    このスレッドでは名前欄に"!dama"を入力すると投稿の名前欄が【xxx円】となる三ヶ日の期間の限定仕様を用いて
    高海千歌というキャラクターに名前欄の分だけお年玉をあげた気持ちになろうという趣旨の企画が催されている。

    このスレッドは1~1000までの投稿があるが、"!dama"によって生成されたお年玉が合計でいくらになったか集計せよ。
    なお、集計するのは"!dama"を入力したことにより生成された額面であり、生成されていない額面については集計の対象外とせよ。
    例:362番目の投稿の名前欄は【74円】【252円】【1136円】となっているが、前者2つは投稿時に名前欄にあったものであり、【1136円】のみが集計対象となる。

    Keyword: "WebScraping","Regex"
    """
