if __name__ == "__main__":
    """

    (1)に示す型は, 一方がミュータブルで, 一方がイミュータブルである.
    (1)に示す型のうち, ミュータブルの方が持ち, イミュータブルの方が持たない属性名のSetを出力せよ.

    (1) List, Tuple

    (1)で出力した属性のうち, 特殊メソッドである属性を用いて,
    (α)と(β)について実装例を示せ.

    (α)
    指定したインデクスの値を削除.

    (β)
    指定したインデクスの値を指定した値に設定.

    (2)から(4)について, Pythonにおけるすべてのクラスが持つ属性を除く,
    以下に示す型の組み合わせに共通する属性名のSetをそれぞれ出力せよ.

    (2) List, Tuple, Dict
    (3) List, Tuple, Dict, str
    (4) List, Tuple, Dict, str, Set

    また(2)から(4)の組み合わせに共通する属性について,
    (2)についてはDict, (3)についてはstr, (4)についてはSetを用いて使用例を示せ.

    """
